In [3]:
import pandas as pd
import sqlite3
from pathlib import Path

In [6]:
db_path = Path.cwd().parent / "data" / "superstore.db"

conn = sqlite3.connect(db_path)

pd.read_sql("SELECT * FROM orders LIMIT 5;", conn)

,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Product ID,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,CA-2012-124891,2012-07-31 00:00:00,2012-07-31 00:00:00,Same Day,RH-19495,TEC-AC-10003033,2309.650,7,0.0,762.1845,933.57,Critical
1,IN-2013-77878,2013-02-05 00:00:00,2013-02-07 00:00:00,Second Class,JR-16210,FUR-CH-10003950,3709.395,9,0.1,-288.7650,923.63,Critical
2,IN-2013-71249,2013-10-17 00:00:00,2013-10-18 00:00:00,First Class,CR-12730,TEC-PH-10004664,5175.171,9,0.1,919.9710,915.49,Medium
3,ES-2013-1579342,2013-01-28 00:00:00,2013-01-30 00:00:00,First Class,KM-16375,TEC-PH-10004583,2892.510,5,0.1,-96.5400,910.16,Medium
4,SG-2013-4320,2013-11-05 00:00:00,2013-11-06 00:00:00,Same Day,RH-9495,TEC-SHA-10000501,2832.960,8,0.0,311.5200,903.04,Critical

In [9]:
query = """
SELECT c."Region",
       ROUND(SUM(o."Sales"), 2) AS total_sales
FROM "Orders" o
JOIN "Customers" c ON o."Customer ID" = c."Customer ID"
GROUP BY c."Region"
ORDER BY total_sales DESC;
"""
pd.read_sql(query, conn)

            Region  total_sales
0          Central  79100858.58
1            South  47341907.84
2            North  34205163.33
3          Oceania  24125966.37
4             West  22150053.32
5   Southeast Asia  20513579.12
6             East  19426971.84
7       North Asia  16753345.89
8     Central Asia  14605091.07
9        Caribbean  11248458.34
10            EMEA   5979455.30
11          Africa   5338420.61
12          Canada    462421.67